README.md


<a id="org207a1bd"></a>

## Theme

    (use-package modus-themes
      :straight (modus-themes
    	     :host gitlab
    	     :repo "protesilaos/modus-themes"
    	     :branch "main")
      :custom
      (modus-themes-slanted-constructs t)
      (modus-themes-bold-constructs t)
      (modus-themes-fringes nil)
      (modus-themes-mode-line '3d)
      (modus-themes-syntax 'yellow-comments)
      (modus-themes-intense-hl-line nil)
      (modus-themes-paren-match 'intense-bold)
      (modus-themes-links nil)
      (modus-themes-no-mixed-fonts nil)
      (modus-themes-prompts nil)
      (modus-themes-completions nil)
      (modus-themes-diffs nil)
      (modus-themes-org-blocks 'grayscale)
      (modus-themes-headings
       '())
      (modus-themes-variable-pitch-headings t)
      (modus-themes-scale-headings t)
      (modus-themes-scale-1 1.1)
      (modus-themes-scale-2 1.15)
      (modus-themes-scale-3 1.21)
      (modus-themes-scale-4 1.27)
      (modus-themes-scale-5 1.33)
      :custom-face
      (font-lock-comment-face
       ((t (:inherit (custom-comment italic variable-pitch)))))
      :init
      (load-theme 'modus-operandi t))


<a id="org52f6c8c"></a>

### Fonts

1.  Define fonts

        (defun font-candidate (&rest fonts)
          (catch :font
            (dolist (font fonts)
              (if (find-font (font-spec :name font))
        	  (throw :font font)))))
        
        (defun acdw/setup-fonts ()
          "Setup fonts.  This has to happen after the frame is setup for
        the first time, so it should be added to `window-setup-hook'.  It
        removes itself from that hook."
          (interactive)
          (set-face-attribute 'default nil
        		      :font
        		      (font-candidate
        		       "Libertinus Mono-11"
        		       "Linux Libertine Mono O-11"
        		       "Go Mono-10"
        		       "Consolas-10"))
        
          (set-face-attribute 'fixed-pitch nil
        		      :font
        		      (font-candidate
        		       "Libertinus Mono-11"
        		       "Linux Libertine Mono O-11"
        		       "Go Mono-10"
        		       "Consolas-10"))
        
          (set-face-attribute 'variable-pitch nil
        		      :font
        		      (font-candidate
        		       "Libertinus Serif-13"
        		       "Linux Libertine O-12"
        		       "Georgia-11"))
        
          (remove-hook 'window-setup-hook #'acdw/setup-fonts))
        
        (add-hook 'window-setup-hook #'acdw/setup-fonts)

2.  Variable-pitch in text modes

        (add-hook 'text-mode-hook #'variable-pitch-mode)

3.  Line spacing

        (cuss line-spacing 0.1)

4.  Unicode fonts

        (use-package unicode-fonts
          :config
          (unicode-fonts-setup))


<a id="org6cbcfe5"></a>

# Interactivity


<a id="org7f26398"></a>

## Selectrum

    (use-package selectrum
      :config
      (selectrum-mode +1))


<a id="orgea8df9e"></a>

## Prescient

    (use-package prescient
      :config
      (prescient-persist-mode +1))
    
    (use-package selectrum-prescient
      :after (selectrum prescient)
      :config
      (selectrum-prescient-mode +1))


<a id="org8818eb9"></a>

## Consult

    (use-package consult
      :after (selectrum)
      :straight (consult
    	     :host github
    	     :repo "minad/consult")
      :bind
      (("C-x b" . consult-buffer)
       ("C-x 4 b" . consult-buffer-other-window)
       ("C-x 5 b" . consult-buffer-other-frame)
       ("M-g o" . consult-outline)
       ("M-g l" . consult-line)
       ("M-y" . consult-yank-pop)
       ("<help> a" . consult-apropos))
      :init
      (fset 'multi-occur #'consult-multi-occur))


<a id="orgd31a964"></a>

## Marginalia

    (use-package marginalia
      :straight (marginalia
    	     :host github
    	     :repo "minad/marginalia"
    	     :branch "main")
      :custom
      (marginalia-annotators
       '((command . marginalia-annotate-command-full)
         (customize-group . marginalia-annotate-customize-group)
         (variable . marginalia-annotate-variable)
         (face . marginalia-annotate-face)
         (symbol . marginalia-annotate-symbol)
         (variable . marginalia-annotate-variable)
         (package . marginalia-annotate-package)))
      :init
      (marginalia-mode +1))


<a id="org6e4913f"></a>

## Ignore case

    (cuss completion-ignore-case t)
    (cuss read-buffer-completion-ignore-case t)
    (cuss read-file-name-completion-ignore-case t)


<a id="org416dd18"></a>

## Search

    (use-package ctrlf
      :custom
      (ctrlf-show-match-count-at-eol nil)
      :bind
      ("C-s" . ctrlf-forward-regexp)
      ("C-r" . ctrlf-backward-regexp)
      ("C-M-s" . ctrlf-forward-literal)
      ("C-M-r" . ctrlf-backward-literal)
      :config
      (ctrlf-mode +1))


<a id="orgb20768d"></a>

# Persistence


<a id="org7dfee32"></a>

## Save history

    (require 'savehist)
    
    (cuss savehist-additional-variables
          '(kill-ring
    	search-ring
    	regexp-search-ring))
    
    (cuss savehist-save-minibuffer-history t)
    
    (cuss history-length t)
    
    (cuss history-delete-duplicates t)
    
    (savehist-mode +1)


<a id="org0f20005"></a>

## Save places in files

    (require 'saveplace)
    
    (cuss save-place-forget-unreadable-files
          (not (eq system-type 'windows-nt)))
    
    (save-place-mode 1)


<a id="org6d1a477"></a>

## Recent files

    (require 'recentf)
    
    (cuss recentf-max-menu-items 100)
    (cuss recentf-max-saved-items 100)
    
    (with-eval-after-load 'no-littering
      (add-to-list 'recentf-exclude no-littering-var-directory)
      (add-to-list 'recentf-exclude no-littering-etc-directory))
    
    (recentf-mode 1)


<a id="org9368a6b"></a>

### Easily navigate recent files

    (defun recentf-find-file ()
      "Find a recent file using `completing-read'."
      (interactive)
      (let ((file (completing-read "Recent file: " recentf-list nil t)))
        (when file
          (find-file file))))
    
    (global-set-key (kbd "C-x C-r") #'recentf-find-file)


<a id="orgbb4f91a"></a>

## Undo

    (use-package undohist
      :config
      (undohist-initialize))


<a id="org52b008a"></a>

# Editing


<a id="orgce838ba"></a>

## Operate visually on lines

    (global-visual-line-mode +1)


<a id="org6f67996"></a>

## Require a final newline

    (cuss require-final-newline t)


<a id="orga2bdb3e"></a>

## Killing & Yanking


<a id="org16c1a6b"></a>

### Replace selection when typing

    (delete-selection-mode +1)


<a id="orgea7fd73"></a>

### Save existing clipboard text into kill ring before replacing it

    (cuss save-interprogram-paste-before-kill t)


<a id="org27f430f"></a>

## So long mode

    (when (fboundp 'global-so-long-mode)
      (global-so-long-mode))


<a id="org8cc8ee8"></a>

# Files


<a id="org8ca2e9b"></a>

## Encoding


<a id="org54363a7"></a>

### UTF-8

    (set-language-environment 'utf-8)
    (set-terminal-coding-system 'utf-8)
    (cuss locale-coding-system 'utf-8)
    (set-default-coding-systems 'utf-8)
    (set-selection-coding-system 'utf-8)
    (prefer-coding-system 'utf-8)


<a id="orgeaed3bd"></a>

### Convert all files to UNIX-style line endings

from [Emacs Wiki](https://www.emacswiki.org/emacs/EndOfLineTips).

    (defun ewiki/no-junk-please-were-unixish ()
      "Convert line endings to UNIX, dammit."
      (let ((coding-str (symbol-name buffer-file-coding-system)))
        (when (string-match "-\\(?:dos\\|mac\\)$" coding-str)
          (set-buffer-file-coding-system 'unix))))

I add it to the `find-file-hook` *and* `before-save-hook` because I don't want to ever work with anything other than UNIX line endings ever again.  I just don't care.  Even Microsoft Notepad can handle UNIX line endings, so I don't want to hear it.

    (add-hook 'find-file-hook #'ewiki/no-junk-please-were-unixish)
    (add-hook 'before-save-hook #'ewiki/no-junk-please-were-unixish)


<a id="org7239c47"></a>

## Backups

    (cuss backup-by-copying 1)
    (cuss delete-old-versions -1)
    (cuss version-control t)
    (cuss vc-make-backup-files t)


<a id="org32fc658"></a>

## Auto-saves

    (auto-save-visited-mode 1)
