config.org
** Revert files

#+begin_src emacs-lisp
  (cuss auto-revert-verbose nil)
  (global-auto-revert-mode +1)
#+end_src

** Add a timestamp to files

#+begin_src emacs-lisp
  (add-hook 'before-save-hook #'time-stamp)
#+end_src

* Programming

** Which function are we in?

#+begin_src emacs-lisp
  (which-function-mode +1)
#+end_src

* Writing

** Visual Fill Column

#+begin_src emacs-lisp
  (use-package visual-fill-column
    :custom
    (split-window-preferred-function
     'visual-fill-column-split-window-sensibly)
    (visual-fill-column-center-text t)
    (fill-column 80)
    :config
    (advice-add 'text-scale-adjust
		:after #'visual-fill-column-adjust)
    :hook
    (text-mode . visual-fill-column-mode))
#+end_src

** Type nice-looking quote-type marks

#+begin_src emacs-lisp
  (use-package typo
    :hook
    (text-mode . typo-mode))
#+end_src

* Applications

** Magit

#+begin_src emacs-lisp
  (use-package magit
    :bind
    ("C-x g" . magit-status))
#+end_src

* Appendices
** Emacs' files
*** init.el
    :PROPERTIES:
    :header-args: :tangle init.el
    :END:

  #+begin_src emacs-lisp :comments no
  ;; init.el -*- lexical-binding: t -*-
  #+end_src
**** Load config

  from [[https://protesilaos.com/dotemacs/#h:584c3604-55a1-49d0-9c31-abe46cb1f028][Protesilaos Stavrou]].

  #+begin_src emacs-lisp
    (let* ((conf (expand-file-name "config"
				   user-emacs-directory))
	   (elc (concat conf ".elc"))
	   (el (concat conf ".el"))
	   (org (concat conf ".org")))
      (cond ((file-exists-p elc) (load-file elc))
	    ((file-exists-p el) (load-file el))
	    (t (require 'org)
	       (org-babel-load-file org))))
  #+end_src

*** early-init.el
    :PROPERTIES:
    :header-args: :tangle early-init.el
    :END:

  #+begin_src emacs-lisp :comments no
  ;; early-init.el -*- lexical-binding: t; no-byte-compile: t; -*-
  #+end_src

  #+begin_src emacs-lisp
    (setq load-prefer-newer t)
    (setq frame-inhibit-implied-resize t)
  #+end_src

** Ease tangling and loading of Emacs' init

 #+begin_src emacs-lisp
   (defun acdw/tangle-and-load-init ()
     (interactive)
     "If the current buffer is `config.org', tangle it, then byte-compile."
     (let ((config (expand-file-name "config.org" user-emacs-directory)))
       (when (string= (buffer-file-name) config)
	 (let ((prog-mode-hook nil))
	   (require 'org)
	   (org-babel-tangle-file config)
	   (org-md-export-to-markdown)

	 (dolist (file `(,(expand-file-name "init.el" 
					    user-emacs-directory)
			 ,(expand-file-name "config.el"
					    user-emacs-directory)))
	   (byte-compile-file file t))))))

   (add-hook 'after-save-hook #'acdw/tangle-and-load-init)
 #+end_src
** License
   :PROPERTIES:
   :header-args: :tangle LICENSE :comments no
   :END:

 Copyright © 2020 Case Duckworth <acdw@acdw.net>

 This work is free.  You can redistribute it and/or modify it under the
 terms of the Do What the Fuck You Want To Public License, Version 2,
 as published by Sam Hocevar.  See the =LICENSE= file, tangled from the
 following source block, for details.

 #+begin_src text
   DO WHAT THE FUCK YOU WANT TO PUBLIC LICENSE

   Version 2, December 2004

   Copyright (C) 2004 Sam Hocevar <sam@hocevar.net>

   Everyone is permitted to copy and distribute verbatim or modified copies of
   this license document, and changing it is allowed as long as the name is changed.

   DO WHAT THE FUCK YOU WANT TO PUBLIC LICENSE

   TERMS AND CONDITIONS FOR COPYING, DISTRIBUTION AND MODIFICATION

      0. You just DO WHAT THE FUCK YOU WANT TO.
 #+end_src

*** Note on the license

 It's highly likely that the WTFPL is completely incompatible with the
 GPL, for what should be fairly obvious reasons.  To that, I say:

 *SUE ME, RMS!*
