README.md


<a id="org94456e2"></a>

## Revert files

    (cuss auto-revert-verbose nil)
    (global-auto-revert-mode +1)


<a id="orgb586b3b"></a>

## Add a timestamp to files

    (add-hook 'before-save-hook #'time-stamp)


<a id="org738fbd9"></a>

# Programming


<a id="org080eb2f"></a>

## Which function are we in?

    (which-function-mode +1)


<a id="org6bf5097"></a>

# Writing


<a id="org6f01971"></a>

## Visual Fill Column

    (use-package visual-fill-column
      :custom
      (split-window-preferred-function
       'visual-fill-column-split-window-sensibly)
      (visual-fill-column-center-text t)
      (fill-column 80)
      :config
      (advice-add 'text-scale-adjust
    	      :after #'visual-fill-column-adjust)
      :hook
      (text-mode . visual-fill-column-mode))


<a id="org03e747d"></a>

## Type nice-looking quote-type marks

    (use-package typo
      :hook
      (text-mode . typo-mode))


<a id="org9528516"></a>

# Applications


<a id="orgd2a60aa"></a>

## Magit

    (use-package magit
      :bind
      ("C-x g" . magit-status))


<a id="org7339cf2"></a>

# Appendices


<a id="org6070b2c"></a>

## Emacs' files


<a id="org0d720f6"></a>

### init.el

    ;; init.el -*- lexical-binding: t -*-

1.  Load config

    from [Protesilaos Stavrou](https://protesilaos.com/dotemacs/#h:584c3604-55a1-49d0-9c31-abe46cb1f028).
    
        (let* ((conf (expand-file-name "config"
        			       user-emacs-directory))
               (elc (concat conf ".elc"))
               (el (concat conf ".el"))
               (org (concat conf ".org")))
          (cond ((file-exists-p elc) (load-file elc))
        	((file-exists-p el) (load-file el))
        	(t (require 'org)
        	   (org-babel-load-file org))))


<a id="orgd6bffd2"></a>

### early-init.el

    ;; early-init.el -*- lexical-binding: t; no-byte-compile: t; -*-

    (setq load-prefer-newer t)
    (setq frame-inhibit-implied-resize t)


<a id="org9c5b437"></a>

## Ease tangling and loading of Emacs' init

    (defun acdw/tangle-and-load-init ()
      (interactive)
      "If the current buffer is `config.org', tangle it, then byte-compile."
      (let ((config (expand-file-name "config.org" user-emacs-directory)))
        (when (string= (buffer-file-name) config)
          (let ((prog-mode-hook nil))
    	(require 'org)
    	(org-babel-tangle-file config)
    	(org-md-export-to-markdown)
    
          (dolist (file `(,(expand-file-name "init.el" 
    					 user-emacs-directory)
    		      ,(expand-file-name "config.el"
    					 user-emacs-directory)))
    	(byte-compile-file file t))))))
    
    (add-hook 'after-save-hook #'acdw/tangle-and-load-init)


<a id="org1a4bb4d"></a>

## License

Copyright © 2020 Case Duckworth <acdw@acdw.net>

This work is free.  You can redistribute it and/or modify it under the
terms of the Do What the Fuck You Want To Public License, Version 2,
as published by Sam Hocevar.  See the `LICENSE` file, tangled from the
following source block, for details.

    DO WHAT THE FUCK YOU WANT TO PUBLIC LICENSE
    
    Version 2, December 2004
    
    Copyright (C) 2004 Sam Hocevar <sam@hocevar.net>
    
    Everyone is permitted to copy and distribute verbatim or modified copies of
    this license document, and changing it is allowed as long as the name is changed.
    
    DO WHAT THE FUCK YOU WANT TO PUBLIC LICENSE
    
    TERMS AND CONDITIONS FOR COPYING, DISTRIBUTION AND MODIFICATION
    
       0. You just DO WHAT THE FUCK YOU WANT TO.


<a id="orga6047ee"></a>

### Note on the license

It's highly likely that the WTFPL is completely incompatible with the
GPL, for what should be fairly obvious reasons.  To that, I say:

**SUE ME, RMS!**

